Icomi1/01.project/01.02视觉巡线小车/code/STM32F1/202121093126祁舰锋视觉巡线小车/Hardware/adc_v.c
#include "stm32f10x.h"                  // Device header
#include "adc_v.h"

void AD_Init(void)
{
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
   
   RCC_ADCCLKConfig(RCC_PCLK2_Div6);
   
   GPIO_InitTypeDef GPIO_InitStructure;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_Init(GPIOA, &GPIO_InitStructure);
   
   ADC_RegularChannelConfig(ADC1, ADC_Channel_4, 1, ADC_SampleTime_239Cycles5);
   
   ADC_InitTypeDef ADC_InitStructure;
   ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
   ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
   ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
   ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
   ADC_InitStructure.ADC_ScanConvMode = DISABLE;
   ADC_InitStructure.ADC_NbrOfChannel = 1;
   ADC_Init(ADC1, &ADC_InitStructure);
   
   ADC_Cmd(ADC1, ENABLE);
   
   ADC_ResetCalibration(ADC1);
   while (ADC_GetResetCalibrationStatus(ADC1) == SET);
   ADC_StartCalibration(ADC1);
   while (ADC_GetCalibrationStatus(ADC1) == SET);
}

float ad_v;
float AD_GetValue(void)
{
   ADC_SoftwareStartConvCmd(ADC1, ENABLE);
   while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
    ad_v = ADC_GetConversionValue(ADC1);
    ad_v = (float)ad_v / 4095 * 3.3*(7.93/0.7193114);//   
   return ad_v;
}
